{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 100,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 101,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 102,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    },
    {
      "id": 103,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": true,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      ["[CLS]", 0],
      ["$A", 0],
      ["[SEP]", 0]
    ],
    "pair": [
      ["[CLS]", 0],
      ["$A", 0],
      ["[SEP]", 0],
      ["$B", 1],
      ["[SEP]", 0]
    ],
    "special_tokens": {
      "[CLS]": {
        "id": 101,
        "type_id": 0
      },
      "[SEP]": {
        "id": 102,
        "type_id": 0
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 100,
      "[CLS]": 101,
      "[SEP]": 102,
      "[MASK]": 103,
      "!": 104,
      "\"": 105,
      "#": 106,
      "$": 107,
      "%": 108,
      "&": 109,
      "'": 110,
      "(": 111,
      ")": 112,
      "*": 113,
      "+": 114,
      ",": 115,
      "-": 116,
      ".": 117,
      "/": 118,
      "0": 119,
      "1": 120,
      "2": 121,
      "3": 122,
      "4": 123,
      "5": 124,
      "6": 125,
      "7": 126,
      "8": 127,
      "9": 128,
      ":": 129,
      ";": 130,
      "<": 131,
      "=": 132,
      ">": 133,
      "?": 134,
      "@": 135,
      "a": 136,
      "b": 137,
      "c": 138,
      "d": 139,
      "e": 140,
      "f": 141,
      "g": 142,
      "h": 143,
      "i": 144,
      "j": 145,
      "k": 146,
      "l": 147,
      "m": 148,
      "n": 149,
      "o": 150,
      "p": 151,
      "q": 152,
      "r": 153,
      "s": 154,
      "t": 155,
      "u": 156,
      "v": 157,
      "w": 158,
      "x": 159,
      "y": 160,
      "z": 161,
      "##a": 162,
      "##b": 163,
      "##c": 164,
      "##d": 165,
      "##e": 166,
      "##f": 167,
      "##g": 168,
      "##h": 169,
      "##i": 170,
      "##j": 171,
      "##k": 172,
      "##l": 173,
      "##m": 174,
      "##n": 175,
      "##o": 176,
      "##p": 177,
      "##q": 178,
      "##r": 179,
      "##s": 180,
      "##t": 181,
      "##u": 182,
      "##v": 183,
      "##w": 184,
      "##x": 185,
      "##y": 186,
      "##z": 187,
      "bank": 188,
      "account": 189,
      "money": 190,
      "finance": 191,
      "credit": 192,
      "debit": 193,
      "transaction": 194,
      "wallet": 195,
      "saving": 196,
      "invest": 197,
      "loan": 198,
      "interest": 199,
      "payment": 200,
      "balance": 201,
      "budget": 202,
      "income": 203,
      "expense": 204,
      "hello": 205,
      "world": 206,
      "##ing": 207,
      "##ed": 208,
      "##ly": 209,
      "##er": 210,
      "##tion": 211,
      "##ment": 212,
      "##able": 213,
      "##ness": 214,
      "##ity": 215,
      "##ous": 216,
      "##ive": 217,
      "##ize": 218,
      "##al": 219,
      "##ic": 220,
      "##ful": 221,
      "##less": 222,
      "##est": 223,
      "##es": 224,
      "##s": 225,
      "##'s": 226,
      "##d": 227,
      "##n": 228,
      "##t": 229
    },
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100
  }
}